Revit 2024 API
Space.SpaceType Property
Get or set the Space type of the Space.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public SpaceType SpaceType { get; set; }
Visual Basic
Public Property SpaceType As SpaceType
	Get
	Set
Visual C++
public:
property SpaceType SpaceType {
	SpaceType get ();
	void set (SpaceType value);
}
Remarks
This property is used to get or set the Space type of the Space.
See Also
Space Class
Autodesk.Revit.DB.Mechanical Namespace